home/controllers/SiteController.php

    public function actionLogin()
    {
        $this->layout      = 'web_main';
        $this->view->title = '登录';
        if (! user()->isGuest) {

            return $this->redirect(['order/buy','id'=>1,'model_type'=>1]);
        }

        $model = new User(['scenario' => 'login']);

        if ($model->load(post())) {
            $user = User::find()->where(['mobile' => $model->username])->one();
---
SELECT * FROM `user` `user` WHERE `mobile`='123456'