pc/models/Product.php

SELECT * FROM `product` `product` WHERE (`on_sale`=1) AND (`state`=1) AND (`type`=1) ORDER BY `hot` DESC
---
    public static function getIndexCashProduct()
    {
        $lists = self::find()->where([
            'on_sale' => self::ON_SALE_YES,
            'state'   => self::STATE_VALID,
            'type'    => self::BUY_TYPE_CASH,
        ])
            ->orderBy('hot DESC')
            ->with('dataAll')
            ->all();